import falafel from "./assets/falafel.jpg";
import phali from "./assets/phali.jpg";
import ice from "./assets/ice.jpeg";
import bowl from "./assets/bowl.jpg";
import napoleon from "./assets/napoleon.jpeg";
import potato from "./assets/potato.jpeg";
import pomelo from "./assets/pomelo.jpeg";
import braslet from "./assets/braslet.jpeg";

interface meal {
  title: string;
  image: any;
  description: string;
  ingridients?: string;
  ingridients2?: string;
  step1?: string;
  step2?: string;
  step3?: string;
  step4?: string;
  step5?: string;
  step6?: string;
  step7?: string;
  step8?: string;
  step9?: string;
}

const meals: meal[] = [
  {
    title: "Гранатовый браслет",
    image: braslet,
    ingridients:
      "2 средних спелых граната (400 г), 800 г шампиньонов, 1 кг сладкого картофеля или моркови, 3 крупные луковицы (600 г), 6 зубчиков чеснока (30 г), 2 банки (по 400 г) нута или белой фасоли. 200 г очищенных грецких орехов. растительное масло, 1 ч. л. копченой паприки, соль, свежемолотый черный перец.",
    ingridients2:
      "Для веганского майонеза: жидкость от нута или белой фасоли, 300 г растительного масла, 1 ст. л. яблочного уксуса, 1 ст. л. дижонской горчицы, 1 ч. л. сахара, 1 ч. л. соли",
    description:
      "«Гранатовый браслет» – один из самых популярных новогодних салатов. Обычно его делают с копченой курицей или другим мясом. Этот вариант – не только веганский, но и без свеклы, которую в таком салате многие не любят. Вкуснее всего получается со сладким картофелем (бататом) – но и с морковью тоже отлично.",
    step1:
      "Начните приготовление «Гранатового браслета» с майонеза: слейте жидкость из банок нута/фасоли в небольшую кастрюльку. Добавьте 2 ложки бобов (нута или фасоли,) соль и сахар, на сильном огне доведите до кипения, варите 2 мин., затем полностью остудите. Перелейте жидкость с бобами в стакан блендера, добавьте горчицу и уксус, взбейте. Продолжая взбивать, тонкой струей влейте масло – в процессе взбивания майонез загустеет.",
    step2:
      "Разогрейте духовку до 200 °С. Очистите сладкий картофель или морковь, смажьте маслом, посолите, заверните по отдельности в фольгу. Запекайте сладкий картофель 30 мин., а морковь – 40 мин. Остудите и натрите на крупной терке.",
    step3:
      "Орехи мелко порубите, вмешайте в сладкий картофель/морковь, приправьте 2 ст. л. майонеза.",
    step4:
      "Лук очистите, нарежьте тонкими полукольцами и обжарьте в растительном масле до золотистого цвета, 15 мин. Смешайте с паприкой, посолите, поперчите. Разомните вилкой нут или фасоль, смешайте с луком и остудите. Добавьте 1 ст. л. майонеза.",
    step5:
      " Раздавите, очистите и измельчите чеснок. Грибы мелко нарежьте, выложите на сухую сковороду без масла. Обжаривайте на сильном огне, часто перемешивая, до появления сильного грибного запаха. Добавьте чеснок и 2 ст. л. масла, жарьте, перемешивая, пока не выпарится вся жидкость, примерно 10 мин. Остудите. Смешайте с 2 ст. л. майонеза.",
    step6:
      "Возьмите круглое блюдо и широкий стакан. Смажьте стакан снаружи маслом и в перевернутом виде поставьте в центр блюда. Вокруг стакана слоями выложите ингредиенты: бобовые с луком – грибы с чесноком – сладкий картофель с орехами. Можно сделать 3 слоя или 6, разделив смеси пополам. Каждый слой аккуратно промазывайте майонезом.",
    step7:
      "Гранатовые зерна освободите от кожуры и перегородок. Обсыпьте салат зернами со всех сторон, слегка вдавливая их в поверхность (стакан пока не вынимайте). Оставьте немного на внутреннюю часть. Поставьте салат в холодильник минимум на 3 ч, можно на 24 ч. Затем аккуратно уберите стакан и присыпьте гранатовыми зернами внутреннюю поверхность «браслета». Готово!",
  },
  {
    title: "Простой фалафель",
    image: falafel,
    ingridients:
      "Нут, 200 г, Лук, ½ головки, Семена кумина (зира), 1 чайная ложка, Петрушка, 1 пучок, Растительное масло, 5 столовых ложек, Специи по вкусу, Соль по вкусу",
    description:
      "Фалафель — популярный ближневосточный фастфуд из нута или фасоли, свежих трав и специй. Считается, что сам рецепт этого блюда был придуман в Египте христианами-коптами, которые искали замену мясу на время длительных постов. И бобовые в данном случае могли стать настоящим спасением: в них много белка и тех самых «медленных» углеводов, обеспечивающих чувство сытости надолго. В последние десятилетия фалафель стал популярен и в России, особенно по мере распространения идей веганства и принципов правильного питания. Поэтому если хотите научиться готовить это блюдо в домашних условиях, принимайте наш рецепт и проверяйте его на практике!",
    step1:
      "В предварительно замоченый нут кладем специи (зира обязательна, остальное на усмотрение), лук (много!), соль, петрушку или кинзу и масло.",
    step2: "Перемалываем блендером.",
    step3:
      "Формируем котлетки (если плохо лепятся, можно добавить немного муки).",
    step4: "Отправляем в духовку на 30 минут при 180 градусах.",
    step5: "Достать из духовки и наслаждаться.",
  },
  {
    title: "Пхали",
    image: phali,
    description:
      "Под названием «пхали» (иногда произносят «мхали») подразумевают не конкретное блюдо, а особый жанр еды. То есть, это принцип приготовления любого исходного продукта – чаще всего  овощей или трав – с заправкой из грецких орехов. Важно понять принцип приготовления и установить правильные пропорции, остальное – дело фантазии.",
    ingridients:
      "Грецкие орехи 1 стакан, шпинат 1 пучок, петрушка 1 пучок, чеснок 2 зубчика, лимонный сок 2 ст. л., соль ½ ч. л.",
    step1:
      "Орехи замочить в воде на 2 часа или больше. Затем воду слить, орехи промыть и прокрутить их через мясорубку. Если у вас есть мощный блендер или измельчитель, можете использовать его.",
    step2:
      "Чеснок очистить, зелень промыть и порезать, чтобы листики были средней величины.",
    step3:
      "Измельчить все в мясорубке. Я обычно прокручиваю 2 раза, чтобы получилась однородная масса. Добавить лимонный сок и соль по вкусу. Можно еще добавить немного черного перца.",
    step4:
      "Скатать шарики размером с грецкий орех (или оставить все, как есть и подавать просто в виде паштета), выложить их на листья шпината и подавать. Приятного аппетита!",
  },
  {
    title: "Шоколадное мороженое",
    image: ice,
    description:
      "Для приготовления этого мороженого можно взять любые ягоды (клубнику, вишню, чернику).",
    ingridients:
      "Миндальное молоко – 1 л, Сахар-песок – 200г, Соль – 2г, Кешью-сливки (рецепт ниже) – 410г, Овсяное молоко – 68 г, Ванильный экстракт – 5 г. или паста Vanilla Lab – 2 г, Гуаровая камедь – 1,4 г, Ксантановая камедь – 0,8 г, Какао-порошок – 89 г, Кусочки веганского печенья типа орео (рецепт ниже) – 96 г Кешью – 150 г, Соль – 1 г., Вода – 110 г., Ванильный сахар (опционально) – 2 г./ванильный экстракт – 5 г., Лимонный сок – 5 г., Сливочное масло веган – 200 г, Сахар демерара – 75 г, Сахар-песок – 75 г, Ванильный экстракт – 2 г, Мука пшеничная – 200 г, Какао-порошок – 75 г, Кукурузный крахмал – 16 г, Разрыхлитель – 3 г, Сода пищевая – 1 г, Соль – 2 г",
    step1:
      "Прежде чем приступить к созданию основного веган-мороженого, сделаем сливки из кешью, веган-орео и веганскую сгущенку. Замочить кешью на 8 часов в холодной воде (если блендер достаточно мощный, можно пропустить этот этап), слить воду и промыть их под проточной водой. Замачивание также помогает орехам лучше усваиваться – из них выходит в воду фитиновая кислота, которую человеку сложно переварить в больших количествах. В блендер поместить все ингредиенты, пробить до полной однородности. Чтобы сделать крем более десертным, обязательно использовать ванильный сахар, можно добавить маленькую щепотку любимой специи или цедру лимона.",
    step2:
      "Веган-орео: Нарезать масло на маленькие кусочки и поместить его в большую миску. Добавить сахара и ваниль, взбить миксером в течение 2 минут до легкой пышности. Добавить просеянные сухие ингредиенты в чашу миксера и насадкой «весло» замесить крутое тесто. Скатать тесто в шар, покрыть пленкой, а лучше – восковой салфеткой. Скатать из теста шарики, приплюснуть их и охладить в течение 15 минут в морозилке. Разогреть духовку до 160 °C. Выложить печенье на противень, оставив место между ними. Выпекать в течение 14-15 минут, достать и полностью остудить печенье. Порубить на кусочки, использовать в рецепте веган-мороженого, либо употребить просто так.",
    step3:
      "Сгущенка на растительном молоке. Вылить растительное молоко, сахар, соль в большой сотейник с антипригарным дном. Довести массу до кипения, помешивая, затем опустить огонь до минимума и дать массе покипеть в течение 2 часов, помешивая массу каждые 15-20 минут, чтобы молоко не пригорало. Масса будет напоминать обычную сгущенку, когда пройдут 2 часа, и самое важное — не дать массе сгореть. Общая масса сгущенки будет равняться примерно 350 граммам. Если масса больше 400-420 граммов, важно выпарить ее еще, вернув на огонь.",
    step4:
      "Теперь, имея все необходимые компоненты, можем приступить к созданию нашего веган-мороженого. Сгущенку и кешью-сливки вылить в стакан. Добавить овсяное молоко, пробить массу погружным блендером. Добавить ваниль и какао-порошок, а также камеди и пробить массу вновь до полной однородности. Дать массе отдохнуть под пленкой в контакт в холодильнике в течение 3-4 часов.",
    step5:
      "Переложить массу в мороженицу, пропустить ее через аппарат. После этого этапа выложить мороженое в миску и добавить печенье, перемешать и затем поместить в мороз для стабилизации.",
    step6:
      "Достать мороженое за 5-10 минут до дегустации, чтобы оно стало более приятным по текстуре. Приятного!",
  },
  {
    title: "Веган-боул",
    image: bowl,
    description:
      "У Веган-боул или Чаши Будды, как еще называют глубокую тарелку, состоящую из ингредиентов исключительно растительного происхождения есть красивая легенда. Основатель буддистской религии после медитаций любил бродить по улицам с чашей в руке. Встретившиеся ему по дороге горожане клали в нее фрукты и овощи, бобы, крупу, зелень. За небольшое время в миске собиралось столько продуктов, что из них можно было соорудить полноценный обед. Не удивляйтесь тому, что и в нашем рецепте так много всего: мы предлагаем перенять опыт знаменитого духовного наставника и приготовить свой вариант популярного блюда не только веганов, но и тех, кто придерживается здорового образа жизни.",
    ingridients:
      "1 большой цукини, 1 большая морковка, половина кочана цветной капусты, небольшой кочан брокколи, 1 средний огурец, 100 г редиски, 1 большое авокадо, 2 стебля сельдерея, 100 г оливок без косточек, 2–3 веточки мяты, 2–3 веточки петрушки, 2–3 веточки базилика, 2–3 пера зеленого лука, половина лайма, 6 ст. л. оливкового масла, свежемолотый черный перец, соль",
    step1:
      "Разогрейте духовку до 200 °C, противень застелите бумагой для выпечки. Разберите брокколи на небольшие соцветия и разложите на противне. Посолите, сбрызните 1 ст. л. оливкового масла и запекайте в центре духовки в течение 20 мин.",
    step2:
      "Натрите цветную капусту на крупной терке. Морковь нарежьте соломкой.",
    step3:
      "В большой сковороде разогрейте 3 ст. л. оливкового масла. На среднем огне обжарьте морковь в течение 4–5 мин и переложите на тарелку. В ту же сковороду положите измельченную цветную капусту и готовьте, помешивая, 3 мин.",
    step4:
      "Огурец нарежьте тонкой соломкой, редис – тонкими кружками. Стебли сельдерея очистите от жестких жилок и нарежьте ломтиками. Зеленый лук, петрушку, мяту и базилик мелко порубите. Авокадо разрежьте вдоль пополам, удалите косточку, снимите кожуру и сбрызните соком лайма.",
    step5:
      "Смажьте маслом сковороду-гриль и хорошо разогрейте. Цукини нарежьте кружками толщиной 1–1,5 см. Выкладывайте цукини небольшими партиями и обжаривайте до появления отчетливых полосок, примерно по 1–2 мин с каждой стороны.",
    step6:
      "Разложите в две миски группами цветную капусту, редис, брокколи, огурцы, цукини, сельдерей и морковь, добавьте оливки и зелень, в центр поместите половинки авокадо. Полейте оливковым маслом и соком лайма, посолите, приправьте перцем и сразу подавайте.",
  },
  {
    title: "Наполеон",
    image: napoleon,
    description:
      "Если вы фанат слоеных тортов и десертов, есть чудесный рецепт веганского Наполеона. Он получается не таким жирным, как обычный, но при этом очень нежным.  Чтобы не тратить время на приготовление слоеного теста, его можно купить в магазине. Главное,  смотрите состав, чтобы в нем не было усилителей вкуса.  Классический крем на сливочном масле можно заменить на более легкую версию.",
    ingridients:
      "1 упаковка бездрожжевого слоеного теста, 1 л соевого молока, 300 г тростникового сахара / кокосового сахара / яблочного пюре, 1 ст. л крахмала тапиоки / кукурузного крахмала",
    step1:
      "Для приготовления крема необходимо выварить соевое молоко с тростниковым сахаром (можно использовать также кокосовый сахар или яблочное пюре). Добавить туда крахмал тапиоки (если нет тапиоки, можно использовать обычный кукурузный крахмал). Заварить все ингредиенты вместе таким образом, чтобы получилась тягучая сгущенка коричневого цвета.",
    step2:
      "Тесто разморозить, нарезать на квадраты и запечь в духовке до готовности (рецепт всегда есть на упаковке).",
    step3:
      "Смазать кремом каждый слой теста и дать пропитаться в течение 2 часов.",
  },
  {
    title: "Картофельный чаудер с тофу",
    image: potato,
    description:
      "Чаудер – сытный американский суп, который чаще всего готовят на рыбном бульоне. Но если рыбы или морепродуктов под рукой не оказалось, можно быстро соорудить вегетарианскую версию с тофу, которая не уступает ни по питательности, ни по вкусу.",
    ingridients:
      "500 г картофеля, 1 крупная луковица, 1 небольшой кочанчик сельдерея, 600 мл кокосового молока, 100 г тофу, 4 ст. л. оливкового масла, 2 ст. л. муки, 1 ст. л. дижонской горчицы,1 ч. л. вустерского соуса, 1 ч. л. порошка карри, соль, свежемолотый белый перец, кинза для подачи.",
    step1:
      "Очистите и нарежьте мелкими кубиками картофель и сельдерей. Сложите овощи в сотейник, залейте кипятком, чтобы овощи были едва прикрыты, доведите снова до кипения, посолите и варите на слабом огне под крышкой до мягкости, примерно 15–20 мин.",
    step2:
      "Пока овощи варятся, очистите и мелкими кубиками нарежьте лук. В глубокой кастрюле с толстым дном поджарьте лук в масле до золотистого цвета.",
    step3:
      "Посыпьте лук мукой и поджаривайте еще пару минут. Влейте кокосовое молоко, постоянно помешивая, чтобы не было комочков. Добавьте горчицу, карри и перец, варите 3–5 мин.",
    step4:
      "Всыпьте нарезанный кубиками тофу и влейте вустерский соус. Добавьте овощи. Если суп окажется слишком густым, подлейте овощного бульона. Прогрейте, но не кипятите! Подавайте, посыпав кинзой.",
  },
  {
    title: "Cалат с помело",
    image: pomelo,
    description:
      "Помело - цитрусовый азиатского проихождения, рецепты с помело можно встретить в национальных кухнях Юго-Восточной Азии, например, в тайской или вьетнамской. Помело не обладает таким ярко выраженным вкусом, как его братья меньшие - апельсины, мандарины и лимоны, но витаминов и полезных веществ в нем не меньше. Помело считается диетическим продуктом: его часто используют для приготовления низкокалорийных блюд и при  диетах для снижения веса.",
    ingridients:
      "3 небольшие сладкие свеклы, 2 апельсина, 1 помело, 2 ст. л. кедровых орешков, 2 большие горсти салатного микса, 3 стебля сельдерея, 2 ч. л. дижонской горчицы, 2 ч. л. меда, 1 ч. л. бальзамического уксуса, 5 ч. л. оливкового масла, цедра 1/2 апельсина, ½ ч. л. соли,сок 1/2 апельсина",
    step1:
      "Отварите свеклу до готовности и очистите руками под струей воды (если свекла полностью сварилась, то кожура легко отойдет). Нарежьте свеклу кружочками.",
    step2:
      "Срежьте у апельсина и помело кожуру вместе с белой ватой и вырежьте сегменты мякоти без пленок.",
    step3: "Кедровые орешки подрумяньте на сухой сковороде.",
    step4:
      "Приготовьте заправку. Стебли сельдерея измельчите в блендере и через марлю отожмите сок. Все, что осталось - сохраните.",
    step5:
      "Соедините в маленькой баночке сок сельдерея и остальные ингредиенты для заправки. Плотно закройте крышкой и хорошенько взболтайте.",
    step6:
      "Выложите в миску салатные листья, свеклу и сегменты цитрусовых. Раскрошите отжатое пюре из сельдерея над миской с салатом. Присыпьте салат кедровыми орешками, полейте заправкой и подавайте.",
  },
];

export default meals;
